cf/BusinessProcesses/ЯчеестаяИнвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>ЯчеестаяИнвентаризация</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Секции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентаризацияПринята</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРасхождение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРезервЯчейка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщееКоличествоВЯчейках</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщееКоличествоНаСкладе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРезервСклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыравнитьКоличество</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НужноПереместить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКПеремещению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/Catalogs/Ячейки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Ячейки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ярус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поддон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>наименование для сортировки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗонаПриемки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьАвтоматическоеРаспределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/BusinessProcesses/ЯчеестаяИнвентаризация/Forms/ФормаБизнесПроцесса_МультиСекции/Ext/Form/Module.bsl
// ОБНОВЛЕНИЕ


&НаСервере
Функция ДобавитьЭлементПоШаблону(ЭлементШаблон, ИмяЭлемента, прИмени, ЭлементРодитель, ПутьКДанным = "", стрЗаменятьПутьКДанным = "",стрИсключения = "", ЗаполнятьСвойства = Истина, Заголовок = "")
	
	Если ПутьКДанным <> "" Тогда
		стрИсключения = стрИсключения + ?(стрИсключения = "","",",") + "ПутьКДанным";
	КонецЕсли;
	
	новЭлемент = Элементы.Добавить(ИмяЭлемента + прИмени, ТипЗнч(ЭлементШаблон), ЭлементРодитель);
	
	Если ЗаполнятьСвойства Тогда
		ЗаполнитьЗначенияСвойств(новЭлемент, ЭлементШаблон,,стрИсключения);
	КонецЕсли;
	
	Если ПутьКДанным <> "" И стрЗаменятьПутьКДанным <> "" Тогда
		новЭлемент.ПутьКДанным = СтрЗаменить(ЭлементШаблон.ПутьКДанным, стрЗаменятьПутьКДанным, ПутьКДанным) + прИмени;
	ИначеЕсли ПутьКДанным <> "" Тогда
		новЭлемент.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Если Заголовок <> "" Тогда
		новЭлемент.Заголовок = Заголовок;
	КонецЕсли;
	
	Возврат новЭлемент;

КонецФункции
&НаСервере
Процедура ОбновитьЗакладкиСекций()
	
	//Добавим секции которые появились
	
	//МассивПоявляемых 	= Новый Массив;
	МассивУдаляемых		= Новый Массив;
	
	КолонкиТаблицы = ТаблицаШаблон.Выгрузить().Колонки;
	
	Для Каждого Элемент Из Секции Цикл
		Если стСекции.НайтиПоЗначению(Элемент.Значение) = Неопределено Тогда
			
			прИмени		= СтрЗаменить(Элемент.Значение,".","_");
			ИмяТаблицы 	= "ТаблицаСекция" + прИмени;
			
			// Добавим таблицу реквизит
			
			МассивПоявляемых 	= Новый Массив;
			
			МассивПоявляемых.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
			
			Для Каждого Колонка Из КолонкиТаблицы Цикл
				МассивПоявляемых.Добавить(Новый РеквизитФормы(Колонка.Имя + прИмени, Новый ОписаниеТипов(Колонка.ТипЗначения), ИмяТаблицы, Колонка.Заголовок, Истина));
			КонецЦикла;
			
			ИзменитьРеквизиты(МассивПоявляемых);
			
			// Добавим Страницу
			
			ЭлементСтраница = ДобавитьЭлементПоШаблону(Элементы.СтраницаСекцияШаблон, "СтраницаСекция", прИмени, Элементы.Страницы,,,"ПутьКДаннымЗаголовка");
			ЭлементСтраница.Видимость = Истина;
			
			// Добавим таблицу элемент
			
			ЭлементТаблица = ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблон, "ТаблицаСекция", прИмени, ЭлементСтраница, ИмяТаблицы,,"ПутьКДаннымКартинкиСтроки");
			
			// Добавим колонки элементов
			
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонЯчейкаЯрус, "ТаблицаЯрус", прИмени, ЭлементТаблица,ИмяТаблицы + ".Ячейка" + прИмени + ".Ярус",, "ВыделенныйТекст, СвязьПоТипу",,"Ярус");
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонЯчейка, "ТаблицаЯчейка", прИмени, ЭлементТаблица, ИмяТаблицы, "ТаблицаШаблон", "ВыделенныйТекст, СвязьПоТипу",,"Ячейка");
			
			ЭлементГруппаКолонокНоменклатура = ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонГруппаНоменклатура, "ТаблицаГруппаНоменклатура", прИмени, ЭлементТаблица,,,,Ложь);
			ЭлементГруппаКолонокНоменклатура.Группировка = ГруппировкаКолонок.ВЯчейке;
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонНоменклатураАртикул, "ТаблицаАртикул", прИмени, ЭлементГруппаКолонокНоменклатура, ИмяТаблицы + ".Номенклатура" + прИмени + ".Артикул",, "ВыделенныйТекст, СвязьПоТипу",,"Артикул");
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонНоменклатура, "ТаблицаНоменклатура", прИмени, ЭлементГруппаКолонокНоменклатура, ИмяТаблицы, "ТаблицаШаблон", "ВыделенныйТекст, СвязьПоТипу",,"Номенклатура");
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонНоменклатураЕдиницаИзмерения, "ТаблицаЕдиницаИзмерения", прИмени, ЭлементГруппаКолонокНоменклатура, ИмяТаблицы + ".Номенклатура" + прИмени + ".ЕдиницаИзмерения",, "ВыделенныйТекст, СвязьПоТипу",,"ед.изм");
			
			ЭлементГруппаКолонокКоличество = ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонГруппаКоличества, "ТаблицаГруппаКоличество", прИмени, ЭлементТаблица,,,,Ложь);
			ЭлементГруппаКолонокКоличество.Группировка = ГруппировкаКолонок.Горизонтальная;
			ЭлементГруппаКолонокКоличество.ОтображатьВШапке = Истина;
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонКоличествоФакт, "ТаблицаФакт", прИмени, ЭлементГруппаКолонокКоличество, ИмяТаблицы, "ТаблицаШаблон", "ВыделенныйТекст, СвязьПоТипу",,"Факт");
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонКоличествоУчет, "ТаблицаУчет", прИмени, ЭлементГруппаКолонокКоличество, ИмяТаблицы, "ТаблицаШаблон", "ВыделенныйТекст, СвязьПоТипу",,"Учет");
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонКоличествоРасхождение, "Таблицарасхождение", прИмени, ЭлементГруппаКолонокКоличество, ИмяТаблицы, "ТаблицаШаблон", "ВыделенныйТекст, СвязьПоТипу",,"Разница");
			
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонКоличествоРезерв, "ТаблицаРезерв", прИмени, ЭлементТаблица, ИмяТаблицы, "ТаблицаШаблон", "ВыделенныйТекст, СвязьПоТипу",,"Резерв");
			
			ЭлементГруппаКолонокОбщееКоличество = ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонОбщееКоличество, "ТаблицаГруппаОбщееКоличество", прИмени, ЭлементТаблица,,,,Ложь);
			ЭлементГруппаКолонокОбщееКоличество.Группировка = ГруппировкаКолонок.Горизонтальная;
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонОбщееКоличествоВЯчейках, "ТаблицаОбщееКоличество", прИмени, ЭлементГруппаКолонокОбщееКоличество, ИмяТаблицы, "ТаблицаШаблон", "ВыделенныйТекст, СвязьПоТипу",,"кол.в секции");
			ДобавитьЭлементПоШаблону(Элементы.ТаблицаШаблонОбщееКоличествоНаСкладе, "ТаблицаНаСкладе", прИмени, ЭлементГруппаКолонокОбщееКоличество, ИмяТаблицы, "ТаблицаШаблон", "ВыделенныйТекст, СвязьПоТипу",,"кол. на складе");
			
		КонецЕсли;
	КонецЦикла;
	
	//ИзменитьРеквизиты(МассивПоявляемых, МассивУдаляемых);
	
	// Запомним что щас есть
	
	стСекции.ЗагрузитьЗначения(Секции.ВыгрузитьЗначения());
	
КонецПроцедуры


// СПИСОК

&НаСервере
Функция ПолучитьСписокСекций()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Проход + ""."" + Секция КАК Секция ИЗ Справочник.Ячейки ГДЕ Ссылка.Владелец = &Склад УПОРЯДОЧИТЬ ПО Секция");
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Секция"));
	
	Возврат Список;
	
КонецФункции


&НаКлиенте
Процедура СекцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Список = ПолучитьСписокСекций();
	
	Если Список.ОтметитьЭлементы() Тогда
		
		Секции.ЗагрузитьЗначения(КонвертацияТипов.ПолучитьОтмеченныеЗначенияСписка(Список));
		ОбновитьЗакладкиСекций();
		
	КонецЕсли;
	
КонецПроцедуры

// ТИПОВЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//стСекции = Новый Массив;
	
КонецПроцедуры
